{"class_name": "Functional", "config": {"name": "QNN", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1568], "dtype": "float64", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "KerasLayer", "config": {"name": "quantumLayer", "trainable": true, "dtype": "float64", "dynamic": true, "output_dim": 1, "weight_specs": {}, "weight_shapes": {"weights": [2, 21, 3]}, "argnum": null}, "name": "quantumLayer", "inbound_nodes": [[["inputs", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0]], "output_layers": [["quantumLayer", 0, 0]]}, "keras_version": "2.10.0", "backend": "tensorflow"}